"Every 10 minutes" = "Cada 10 minutos";
"Manually" = "Manualmente";
"Rescan" = "Reexaminar";
"Show Info" = "Mostrar información";
"Delete selected source" = "Borrar el origen seleccionado";
"Every day" = "Cada día";
"Add source..." = "Añadir origen...";
"Every half hour" = "Cada media hora";
"Rescan source" = "Reexaminar origen";
"Sources" = "Orígenes";
"Every hour" = "Cada hora";
"Rescan frequency" = "Frecuencia de reexaminado";
